In [1]:
import pandas as pd  # import Library
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('insurance.csv')

In [3]:
df.head() #get all column head from the csv file as table

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [4]:
df.shape  #getting rows and columns in data frame

(1338, 7)

In [5]:
df.isnull() # false means there is ni null or NaN value

        age    sex    bmi  children  smoker  region  charges
0     False  False  False     False   False   False    False
1     False  False  False     False   False   False    False
2     False  False  False     False   False   False    False
3     False  False  False     False   False   False    False
4     False  False  False     False   False   False    False
...     ...    ...    ...       ...     ...     ...      ...
1333  False  False  False     False   False   False    False
1334  False  False  False     False   False   False    False
1335  False  False  False     False   False   False    False
1336  False  False  False     False   False   False    False
1337  False  False  False     False   False   False    False

[1338 rows x 7 columns]

In [6]:
df.isnull().sum() # all columns shows zero that is no null or NaN value

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [7]:
df.head

<bound method NDFrame.head of       age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]>

In [8]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [9]:
df1 = df.copy()

In [10]:
df1.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [11]:
df.sex.unique() # getting unique value in sex column

array(['female', 'male'], dtype=object)

In [12]:
df.smoker.unique() # getting unique value in smoker column

array(['yes', 'no'], dtype=object)

In [13]:
df.region.unique() # getting unique value in region column

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [14]:
df.sex = df.sex.replace(['male','female'],[1,2])

In [15]:
df.head()

   age  sex     bmi  children smoker     region      charges
0   19    2  27.900         0    yes  southwest  16884.92400
1   18    1  33.770         1     no  southeast   1725.55230
2   28    1  33.000         3     no  southeast   4449.46200
3   33    1  22.705         0     no  northwest  21984.47061
4   32    1  28.880         0     no  northwest   3866.85520

In [16]:
df.smoker = df.smoker.replace(['yes','no'],[1,0])

In [17]:
df.head()

   age  sex     bmi  children  smoker     region      charges
0   19    2  27.900         0       1  southwest  16884.92400
1   18    1  33.770         1       0  southeast   1725.55230
2   28    1  33.000         3       0  southeast   4449.46200
3   33    1  22.705         0       0  northwest  21984.47061
4   32    1  28.880         0       0  northwest   3866.85520

In [18]:
df.region = df.region.replace(['southwest','southeast','northwest','northeast'],[4,3,2,1])

In [19]:
df.head()

   age  sex     bmi  children  smoker  region      charges
0   19    2  27.900         0       1       4  16884.92400
1   18    1  33.770         1       0       3   1725.55230
2   28    1  33.000         3       0       3   4449.46200
3   33    1  22.705         0       0       2  21984.47061
4   32    1  28.880         0       0       2   3866.85520

In [20]:
df.shape

(1338, 7)

In [21]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder

In [22]:
from pandas.core.dtypes.common import is_numeric_dtype

In [23]:
df1.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [24]:
for colm in df1.columns:
    if is_numeric_dtype(df1[colm]):
        continue
        
    df1[colm] = le.fit_transform(df1[colm])

<class 'TypeError'>: LabelEncoder.fit_transform() missing 1 required positional argument: 'y'

In [25]:
df1.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [26]:
df1.sex = df1.sex.replace([1,2],['male','female'])
df1.smoker = df1.smoker.replace([1,0],['yes','no'])
df1.region = df1.region.replace([4,3,2,1],['southwest','southeast','northwest','northeast'])

In [27]:
df1.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [28]:
df2 = df1.copy()

In [29]:
df2.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [30]:
#Using One-Hot Encoding bellow

In [31]:
#columns = ['sex','smoker']

#for col in columns:
  #  one_hot = pd.get_dummies(df2[col],drop_first=True, prefix='')
  #  one_hot.head()




columns = ['sex']      

for col in columns:
    one_hot = pd.get_dummies(df2[col],drop_first=True, prefix='sex')
    df2 = pd.concat([df2, one_hot], axis=1).drop(col,axis=1)

In [32]:
df2.head()

   age     bmi  children smoker     region      charges  sex_male
0   19  27.900         0    yes  southwest  16884.92400         0
1   18  33.770         1     no  southeast   1725.55230         1
2   28  33.000         3     no  southeast   4449.46200         1
3   33  22.705         0     no  northwest  21984.47061         1
4   32  28.880         0     no  northwest   3866.85520         1

In [33]:
columns = ['smoker']      

for col in columns:
    one_hot = pd.get_dummies(df2[col],drop_first=True, prefix='smoker')
    df2 = pd.concat([df2, one_hot], axis=1).drop(col,axis=1)

In [34]:
df2.head()

   age     bmi  children     region      charges  sex_male  smoker_yes
0   19  27.900         0  southwest  16884.92400         0           1
1   18  33.770         1  southeast   1725.55230         1           0
2   28  33.000         3  southeast   4449.46200         1           0
3   33  22.705         0  northwest  21984.47061         1           0
4   32  28.880         0  northwest   3866.85520         1           0

In [35]:
columns = ['region']      

for col in columns:
    one_hot = pd.get_dummies(df2[col],drop_first=True, prefix='region')
    df2 = pd.concat([df2, one_hot], axis=1).drop(col,axis=1)

In [36]:
df2.head()

,age,bmi,children,charges,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

In [37]:
df1.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [38]:
df3 = df1.copy()

In [39]:
df3.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [40]:
df3 = pd.get_dummies(df3, columns = ['sex','smoker','region'])

In [41]:
df3.head()

,age,bmi,children,charges,sex_female,sex_male,smoker_no,smoker_yes,region_northeast,region_northwest,region_southeast,region_southwest
0,19,27.900,0,16884.92400,1,0,0,1,0,0,0,1
1,18,33.770,1,1725.55230,0,1,1,0,0,0,1,0
2,28,33.000,3,4449.46200,0,1,1,0,0,0,1,0
3,33,22.705,0,21984.47061,0,1,1,0,0,1,0,0
4,32,28.880,0,3866.85520,0,1,1,0,0,1,0,0

In [42]:
df1.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [43]:
df4 = df1.copy()

In [44]:
df4.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [45]:
from sklearn.preprocessing import OrdinalEncoder

In [46]:
gender = df4.sex.unique()
cig = df4.smoker.unique()
location = df4.region.unique()

In [47]:
cig = ['no','yes']
location = ['northeast', 'northwest', 'southeast', 'southwest']

In [48]:
ordi = OrdinalEncoder(categories=[gender,cig,location])
ordi

OrdinalEncoder(categories=[array(['female', 'male'], dtype=object),
                           ['no', 'yes'],
                           ['northeast', 'northwest', 'southeast',
                            'southwest']])

In [49]:
myvalue = ordi.fit_transform(df4[['sex','smoker','region']])
myvalue

array([[0., 1., 3.],
       [1., 0., 2.],
       [1., 0., 2.],
       ...,
       [0., 0., 2.],
       [0., 0., 3.],
       [0., 1., 1.]])

In [53]:
df4[['sex','smoker','region']] = pd.DataFrame(myvalue)

In [54]:
df4.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     1.0     3.0  16884.92400
1   18  1.0  33.770         1     0.0     2.0   1725.55230
2   28  1.0  33.000         3     0.0     2.0   4449.46200
3   33  1.0  22.705         0     0.0     1.0  21984.47061
4   32  1.0  28.880         0     0.0     1.0   3866.85520